print('Меню')
print(
"""
┌────┬───────────┬────────────┐
│ №  │ Напиток   │ Цена       │
├────┼───────────┼────────────┤
│ 1  │ Кофе ☕   │ 120 рублей │
│ 2  │ Чай 🍵    │ 80 рублей  │
│ 3  │ Сок 🧃     │ 100 рублей │
│ 4  │ Вода 💧    │ 50 рублей  │
│ 5  │ Лимонад 🥤│ 90 рублей  │
└────┴───────────┴────────────┘
"""
)
index, number = map(int, input('Введите номер напитка и количество через пробел: ').split())
if number <=0:
    print("Хаха, ну ты и шутник. Вон")
    exit()
promo = input('А может еще и промокодик есть?')
match promo:
    case 'student':
        discont = 0.2
    case 'first':
        discont = 0.25
    case _:
        print('Такого промокода нет к сожалению')
        discont = 0
match index:
    case 1:
        drink = 'Кофе ☕'
        price = 120
    case 2:
        drink = 'Чай 🍵'
        price = 80
    case 3:
        drink = 'Сок 🧃'
        price = 100
    case 4:
        drink = 'Вода 💧'
        price = 50
    case 5:
        drink = 'Лимонад 🥤'
        price = 90
    case _:
        print("Соре,такого нет у нас в меню")
        exit()

print(
f"""
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
┃ 📦 Статус вашего заказа 📦┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛

Товар: {drink}
Цена за единицу: {price}
Количество: {number}
Сумма: {price*number}
"""
)
if discont != 0:
    print(f"Скидка '{promo}' ({discont*100}%): -{price*number*discont} руб")
print(f"""
==================================
К ОПЛАТЕ: {price*number-price*discont*number}
==================================
""")
