
error = 0

print('Система статусов заказа')
print(
"""
Возможные статусы:
"pending" (в ожидании)
"processing" (в обработке)
"shipped" (отправлено)
"delivered" (доставлено)
"cancelled" (отменено)
"""
)
stat_input = str(input("Введите статус вашего заказа:"))


match stat_input:
    case "pending":
        status = "В ожидании 🕐"
        description = " Ваш заказ обрабатывается"
        time = "7-9 дней"
        recommendation = "Ждите,следите за уведомлениями"
    case "processing":
        status = "В обработке 📦"
        description = " Ваш заказ собирается"
        time = "5-6 дней"
        recommendation = "Ждите,следите за уведомлениями"
    case "shipped":
        status = "Отправлено ✈️"
        description = " Ваш заказ находится в пути"
        time = "2-5 дней"
        recommendation = "Ждите,следите за уведомлениями"
    case "delivered":
        status = "Доставлено ✅"
        description = " Ваш заказ в пункте выдачи"
        time = "На месте"
        recommendation = "Можно забирать"
    case "cancelled":
        status = "Отменен ❌"
        description = "Ваш заказ отменен"
        time = "-"
        recommendation = "Обратитесь в техподдержку"
    case _:
        error += 1

if error == 0:
    print(
        f"""
        ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
        ┃ 📦 Статус вашего заказа 📦┃
        ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
        
        Статус: {status}
        Описание: {description}
        Примерное время: {time}
        Рекомендация: {recommendation}
        """
    )

else:
    print(
        f"""
        ❌ Ошибка Неизвестный статус "{stat_input}"
        Доступные статусы: pending, processing, shipped, delivered, cancelled
        """
    )